# Pandas

Pandas means "Python Data Analysis Library" 
Is for: Readingm writing, manipulating and analyzing data. 
It helpful for analyzing largest data sets

# Pandas Objects

There are two data structures in Pandas library: 
1. Series
2. DataFrame

# Series

Is an unidemensional array tagged. Can contain data from different data types, is like a column in an table.
Series are like lists in python, they can take any value and any type of data, such as strings, integers, floats, etc.

# Creating an Series

In [2]:
# Importing Pandas library
import pandas as pd

In [2]:
# Creating a Pandas Series from a List 
# Creating a List 
l = ['Jose', 22, 'King', 'Winterfell']
# Creating a Serie
pd.Series(l)

0          Jose
1            22
2          King
3    Winterfell
dtype: object

In [4]:
# Creating a Pandas Series from a Dictionary 
# Creating a dictionary
l = {'One': 1, 'Two': 2, 'Three': 3, 'Four': 4, 'Five': 5, 'Six': 6, 'Seven': 7, 'Eight': 8, 'Nine': 9, 'Ten': 10}
# Creating a Serie
pd.Series(l)

One       1
Two       2
Three     3
Four      4
Five      5
Six       6
Seven     7
Eight     8
Nine      9
Ten      10
dtype: int64

In [3]:
# Example of Series Object 
data = pd.Series([0.25, 0.5,0.75,1.0])
print(data)

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

# DataFrame

Is two-dimensional tabular data structure with labeled axes. Think a 'DataFra,e' object as a collection of 'series', where each of these object in the 'Series' shares a common index, the index of the 'DataFrame' object.

# Creating A DataFrame

We can create a DataFrame from a list or a Numpy Array

In [5]:
# Example 
data = [[1000, 'Steve',86.29],
       [1001, 'Mathew', 91.63],
       [1002, 'Jose', 72.90],
       [1003, 'Patty', 69.23],
       [1004, 'Vin', 88.30]]
pd.DataFrame(data)

      0       1      2
0  1000   Steve  86.29
1  1001  Mathew  91.63
2  1002    Jose  72.90
3  1003   Patty  69.23
4  1004     Vin  88.30

In [8]:
# from a Numpy array create a DataFrame
heights = pd.array([1.80,1.75,1.90,1.60,1.55,1.65,1.70,1.82])
print(type(heights))

<class 'pandas.core.arrays.floating.FloatingArray'>

In [17]:
x=pd.DataFrame(heights)

In [18]:
x

      0
0   1.8
1  1.75
2   1.9
3   1.6
4  1.55
5  1.65
6   1.7
7  1.82

In [12]:
type(x)

pandas.core.frame.DataFrame

In [14]:
# Add names to he column of a DataFrame and can give your own index
data = [[1000, 'Steve',86.29],
       [1001, 'Mathew', 91.63],
       [1002, 'Jose', 72.90],
       [1003, 'Patty', 69.23],
       [1004, 'Vin', 88.30]]
pd.DataFrame(data, columns=['Regd. No', 'Name', 'Marks%'], index=[1,2,3,4,5])

   Regd. No    Name  Marks%
1      1000   Steve   86.29
2      1001  Mathew   91.63
3      1002    Jose   72.90
4      1003   Patty   69.23
5      1004     Vin   88.30

In [19]:
x=pd.DataFrame(heights, columns=['Heights'])

In [20]:
x

   Heights
0      1.8
1     1.75
2      1.9
3      1.6
4     1.55
5     1.65
6      1.7
7     1.82

In [21]:
# Can create a DataFrame from a Dictionary 
data = {'Regd. No': [1000,1001,1002,1003,1004],
       'Names': ['Steve', 'Mathew', 'Jose', 'Patty', 'Vin'],
       'Marks': [86.29,91.63,72.90,69.23,88.30]}
pd.DataFrame(data)

   Regd. No   Names  Marks
0      1000   Steve  86.29
1      1001  Mathew  91.63
2      1002    Jose  72.90
3      1003   Patty  69.23
4      1004     Vin  88.30

# a Column is a Series 
A data frame is a collection of Series.
A Series is a column in a table or a DataFrame

# Read and Write Files

In [23]:
# Reading Data Files

Data exists in many formats. The most basic of these is the CSV file. CSV stands for comma-separated-values.

CSV files are usually created by programs that handle large amounts of data. They are a convenient way to export data from spreadsheets and databases and import or use them in other programs.

CSV is a simple file format that stores tabular data, such as a spreadsheet or database.

A CSV file stores tabular data (numbers and text) in plain text.

Each line of the file is a data record/row.

Each record consists of one or more fields, separated by commas.

The use of the comma as a field separator is the source of the name for this file format.

# Working with CSV files in Python

For working with CSV files in Python, there is an inbuilt module named csv.

However, a common method for working with CSV files is using Pandas. It makes importing and analyzing data much easier.

One crucial feature of Pandas is its ability to write and read Excel, CSV, and many other types of files.

# Pandas read_csv

Functions like the Pandas read_csv() method enable you to work with files effectively.

The read_csv() function reads the CSV file into a DataFrame object.

A CSV file is similar to a two-dimensional table, and the DataFrame object represents a two-dimensional tabular view.

In [24]:
# Syntax
# pd.read_csv('filename direction with name of the file .csv')

# Pandas to_csv

The easiest way to write DataFrames to CSV files is using the Pandas to_csv function.

In [25]:
# Syntax 
# DataFrame to CSV file
# def is the name of the DataFrame here 
# df.to_csv('file name.csv')

In [ ]:
# If you want to export without the index, add index=False:
# df.to_csv('file direction name of the file.csv', index=False)

# Methods and Attributes of DataFrame

shape attribute
shape: It will help you to know the shape of your DataFrame, i.e., (number of rows, number of columns).

head( ) method
head( ): It will help you see the first five observations of your DataFrame. You can get some idea about the content of your DataFrame.
head() gives us a quick look at the contents of the DataFrame, like column headers, data types of columns, what data each column has, etc.

tail( ) method
tail( ): This method is similar to the head() method, but instead of the first five, it will give you the last five observations from your dataset.
We can see the dataset's last five observations in the table above.

dtypes
dtypes: It will help you know about the data types of each column.
To know the data types associated with each column, we can use dtypes attribute.

info( )
info( ): This method will return a concise summary of the DataFrame.